# Taps
tap 'heroku/brew'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/cask-drivers'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
tap 'shopify/shopify'
tap 'stripe/stripe-cli'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'b2-tools'
brew 'coreutils' # Those that come with macOS are outdated
brew 'doctl'
brew 'figlet'
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'gnupg'
brew 'grep'
brew 'iperf3'
brew 'heroku'
brew 'htop'
brew 'httpie'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'nano'
brew 'ncdu'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'shopify-cli'
brew 'siege'
brew 'speedtest-cli'
brew 'stripe/stripe-cli/stripe'
brew 'stripe/stripe-mock/stripe-mock'
brew 'svn' # Needed to install fonts
brew 'testdisk'
brew 'tmux'
brew 'wp-cli'
brew 'youtube-dl'

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'php'
brew 'php@8.0'
brew 'php@7.4'
brew 'composer'
brew 'imagemagick'
brew 'mailhog'
brew 'meilisearch'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'

# Apps
cask 'adobe-creative-cloud'
cask 'alfred'
cask 'anydesk'
cask 'audio-hijack'
cask 'authy'
cask 'bartender'
cask 'clickup'
cask 'drawio'
cask 'dropshare'
cask 'f-bar'
cask 'fig'
cask 'figma'
cask 'firefox'
cask 'focusrite-control'
cask 'fork'
cask 'github'
cask 'google-chrome'
cask 'ibettercharge'
cask 'iina'
cask 'imagealpha'
cask 'imageoptim'
cask 'insomnia'
cask 'invoker'
cask 'istat-menus'
cask 'iterm2'
cask 'jdownloader'
cask 'logitech-options'
cask 'logitech-g-hub'
cask 'loopback'
cask 'microsoft-edge'
cask 'microsoft-teams'
cask 'mpv'
cask 'notion'
cask 'obs'
cask 'paragon-ntfs'
cask 'phpmon'
cask 'phpstorm'
cask 'post-haste'
cask 'quicktime-player7'
cask 'radio-silence'
cask 'ray'
cask 'skype'
cask 'skype-for-business'
cask 'slack'
cask 'spotify'
cask 'synology-drive'
cask 'tableplus'
cask 'teamviewer'
cask 'the-unarchiver'
cask 'tinkerwell'
cask 'tint'
cask 'transmission'
cask 'transmit'
cask 'tunnelbear'
cask 'viber'
cask 'visual-studio-code'
cask 'vlc'
cask 'vnc-viewer'
cask 'webex'
cask 'zoom'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-fira-code'
cask 'font-fira-code-nerd-font'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'EdgeCase', id: 513826860
mas 'GarageBand', id: 682658836
mas 'JSON Peep for Safari', id: 1458969831
mas 'Keynote', id: 409183694
mas 'Magnet', id: 441258766
mas 'Microsoft Word', id: 462054704
mas 'Microsoft Excel', id: 462058435
mas 'Microsoft PowerPoint', id: 462062816
mas 'Microsoft Remote Desktop', id: 1295203466
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Speedtest', id: 1153157709
mas 'TextSniper - OCR simplified', id: 1528890965
mas 'Transmit 5', id: 1436522307
max 'Xcode', id: 497799835
